export const ErrorMessageMapper: Record<string, string> = {
  'Unknown error': 'Произошла неизвестная ошибка, попробуйте позже',
  'Http error': 'Ошибка соединения, попробуйте позже',
  'Grammy error': 'Что то пошло не так, попробуйте позже',

  'Ошибка при создании пользователя с бд': 'Произошла внутренняя ошибка, попробуйте позже',
  'Имя пользователя слишком длинное': 'У вас слишком длинное название профиля, пожалуйста измените его',
  'Имя пользователя слишком короткое': 'У вас слишком короткое название профиля, пожалуйста измените его',
  'Невалидный Telegram ID': 'У вас невалидный telegram id, попробуйсте позже',
  'Validation failed': 'Ошибка при валидации переданных данных, попробуйте ещё раз',
  'Nest request failed': 'Произошла внутренняя ошибка, попробуйте позже',
};
